
const Y = 35.223557 - 35.093178 // 上小田井-名古屋港間の距離
const X = 137.021284 - 136.853421 // 藤が丘-高畑間の距離
const scaleFactor = 1000/X // 幅1000pxを基準にレイアウトを最適化する。その後、デバイスの幅にあわせてCSSのtransform: scale()で拡大縮小させる

class Station {
    constructor (name, latitude, longitude) {
        this.name = name
        // 経度と緯度を、各駅を地図上で区別しやすい位置にプロットできるように
        // 上小田井の緯度(35.223557)を0, 高畑の経度(136.853421)を0とする相対値に変換する
        // 適度な縮尺になるようにscaleFactor倍する
        this.y = Math.round((35.223557 - latitude) * scaleFactor)
        this.x = Math.round((longitude - 136.853421) * scaleFactor)

        // 地図上の同名のid属性値をもつli要素のスタイルに位置を設定する
        const li = document.getElementById(this.name)
        li.style.left = `${this.x}px`
        li.style.top = `${this.y}px`
    }

    getName() {
        return this.name
    }

    getX() {
        return this.x
    }

    getY() {
        return this.y
    }
}

/* 乗り換え駅 */
const 名古屋  = new Station ('名古屋', 35.171402, 136.884021)
const 久屋大通  = new Station ('久屋大通', 35.173757, 136.907747)
const 丸の内  = new Station ('丸の内', 35.174577, 136.896852)
const 伏見 = new Station ('伏見', 35.169294, 136.897386)
const 栄 = new Station ('栄', 35.170051, 136.908544)
const 今池  = new Station ('今池', 35.169981, 136.937234)
const 御器所  = new Station ('御器所', 35.149569, 136.933608)
const 新瑞橋 = new Station ('新瑞橋', 35.117719, 136.937202)
const 本山 = new Station ('本山', 35.163547, 136.963603)
const 八事 = new Station ('八事', 35.136914, 136.964219)
const 平安通 = new Station ('平安通', 35.195807, 136.929698)


/* 東山線 */
const 高畑 = new Station ('高畑', 35.139852, 136.853421)
const 八田 = new Station ('八田', 35.149226, 136.853226)
const 岩塚 = new Station ('岩塚', 35.158156, 136.854384)
const 中村公園 = new Station ('中村公園', 35.167804, 136.854771)
const 中村日赤 = new Station ('中村日赤', 35.172803, 136.862195)
const 本陣 = new Station ('本陣', 35.177188, 136.866701)
const 亀島 = new Station ('亀島', 35.177468, 136.876722)
// 名古屋
// 伏見
// 栄
const 新栄町 = new Station ('新栄町', 35.170786, 136.920453)
const 千種 = new Station ('千種', 35.170207, 136.930387)
// 今池
const 池下 = new Station ('池下', 35.167716, 136.946652)
const 覚王山 = new Station ('覚王山', 35.166558, 136.953326)
// 本山
const 東山公園 = new Station ('東山公園', 35.160471, 136.972745)
const 星ヶ丘 = new Station ('星ヶ丘', 35.162523, 136.985298)
const 一社 = new Station ('一社', 35.168312, 136.995898)
const 上社 = new Station ('上社', 35.173644, 137.006713)
const 本郷 = new Station ('本郷', 35.175437, 137.013466)
const 藤が丘 = new Station ('藤が丘', 35.182441, 137.021284)


/* 名城線 */
const 金山 = new Station ('金山', 35.142919, 136.901045)
const 東別院 = new Station ('東別院', 35.149998, 136.904639)
const 上前津 = new Station ('上前津', 35.157253, 136.906752)
const 矢場町 = new Station ('矢場町', 35.163726, 136.908898)
// 栄
// 久屋大通
const 市役所 = new Station ('市役所', 35.181241, 136.905347)
const 名城公園 = new Station ('名城公園', 35.190832, 136.904607)
const 黒川 = new Station ('黒川', 35.197189, 136.910078)
const 志賀本通 = new Station ('志賀本通', 35.196289, 136.921233)
// 平安通
const 大曽根 = new Station ('大曽根', 35.191938, 136.936897)
const ナゴヤドーム前矢田 = new Station ('ナゴヤドーム前矢田', 35.190614, 136.945598)
const 砂田橋 = new Station ('砂田橋', 35.188914, 136.954344)
const 茶屋ヶ坂 = new Station ('茶屋ヶ坂', 35.184477, 136.962391)
const 自由ヶ丘 = new Station ('自由ヶ丘', 35.175625, 136.966718)
// 本山
const 名古屋大学 = new Station ('名古屋大学', 35.154531, 136.966561)
const 八事日赤 = new Station ('八事日赤', 35.144547, 136.965002)
// 八事
const 総合リハビリセンター = new Station ('総合リハビリセンター', 35.130497, 136.954474)
const 瑞穂運動場東 = new Station ('瑞穂運動場東', 35.123228, 136.948666)
// 新瑞橋
const 妙音通 = new Station ('妙音通', 35.117324, 136.929558)
const 堀田 = new Station ('堀田', 35.116596, 136.921694)
const 伝馬町 = new Station ('伝馬町', 35.120774, 136.910367)
const 神宮西 = new Station ('神宮西', 35.128004, 136.906578)
const 西高蔵 = new Station ('西高蔵', 35.134638, 136.901783)


/* 桜通線 */
const 中村区役所  = new Station ('中村区役所', 35.167675, 136.872412)
// 名古屋
const 国際センター  = new Station ('国際センター', 35.172201, 136.889578)
// 丸の内
// 久屋大通
const 高岳  = new Station ('高岳', 35.174169, 136.915724)
const 車道  = new Station ('車道', 35.173461, 136.929434)
// 今池
const 吹上  = new Station ('吹上', 35.158849, 136.935206)
// 御器所
const 桜山 = new Station ('桜山', 35.139945, 136.933307)
const 瑞穂区役所 = new Station ('瑞穂区役所', 35.131785, 136.934402)
const 瑞穂運動場西 = new Station ('瑞穂運動場西', 35.124951, 136.935442)
// 新瑞橋
const 桜本町  = new Station ('桜本町', 35.109337, 136.936848)
const 鶴里  = new Station ('鶴里', 35.105703, 136.943521)
const 野並  = new Station ('野並', 35.102342, 136.955527)
const 鳴子北  = new Station ('鳴子北', 35.102684, 136.966266)
const 相生山  = new Station ('相生山', 35.102501, 136.976041 )
const 神沢  = new Station ('神沢', 35.098602, 136.989333 )
const 徳重 = new Station ('徳重', 35.094986, 136.997305)


/* 鶴舞線 */
const 上小田井 = new Station ('上小田井', 35.223557, 136.876847)
const 庄内緑地公園 = new Station ('庄内緑地公園', 35.215207, 136.886861)
const 庄内通 = new Station ('庄内通', 35.204529, 136.891001)
const 浄心 = new Station ('浄心', 35.192234, 136.890816)
const 浅間町 = new Station ('浅間町', 35.183571, 136.890295)
// 丸の内
// 伏見
const 大須観音 = new Station ('大須観音', 35.160338, 136.898229)
// 上前津
const 鶴舞 = new Station ('鶴舞', 35.156411, 136.917523)
const 荒畑 = new Station ('荒畑', 35.149626, 136.925884)
// 御器所
const 川名 = new Station ('川名', 35.148875, 136.947658)
const いりなか = new Station ('いりなか', 35.143399, 136.955175)
// 八事
const 塩釜口 = new Station ('塩釜口', 35.132452, 136.977901)
const 植田 = new Station ('植田', 35.128716, 136.987599)
const 原 = new Station ('原', 35.126163, 136.996584)
const 平針 = new Station ('平針', 35.122831, 137.006863)
const 赤池 = new Station ('赤池', 35.121172, 137.018281)


/* 名港線 */
const 日比野 = new Station ('日比野', 35.132738, 136.893056)
const 六番町 = new Station ('六番町', 35.124161, 136.888419)
const 東海通 = new Station ('東海通', 35.113488, 136.886036)
const 港区役所 = new Station ('港区役所', 35.106063, 136.884577)
const 築地口 = new Station ('築地口', 35.099498, 136.883096)
const 名古屋港 = new Station ('名古屋港', 35.093178, 136.881932)


/* 上飯田線 */
const 上飯田 = new Station ('上飯田', 35.203518, 136.929579)


/* 各路線 */
const 東山線 = [
    高畑,
    八田,
    岩塚,
    中村公園,
    中村日赤,
    本陣,
    亀島,
    名古屋,
    伏見,
    栄,
    新栄町,
    千種,
    今池,
    池下,
    覚王山,
    本山,
    東山公園,
    星ヶ丘,
    一社,
    上社,
    本郷,
    藤が丘,
]

const 名城線 = [
    金山,
    東別院,
    上前津,
    矢場町,
    栄,
    久屋大通,
    市役所,
    名城公園,
    黒川,
    志賀本通,
    平安通,
    大曽根,
    ナゴヤドーム前矢田,
    砂田橋,
    茶屋ヶ坂,
    自由ヶ丘,
    本山,
    名古屋大学,
    八事日赤,
    八事,
    総合リハビリセンター,
    瑞穂運動場東,
    新瑞橋,
    妙音通,
    堀田,
    伝馬町,
    神宮西,
    西高蔵,
    金山
]

const 桜通線 = [
    中村区役所,
    名古屋,
    国際センター,
    丸の内,
    久屋大通,
    高岳,
    車道,
    今池,
    吹上,
    御器所,
    桜山,
    瑞穂区役所,
    瑞穂運動場西,
    新瑞橋,
    桜本町,
    鶴里,
    野並,
    鳴子北,
    相生山,
    神沢,
    徳重
]

const 鶴舞線 = [
    上小田井,
    庄内緑地公園,
    庄内通,
    浄心,
    浅間町,
    丸の内,
    伏見,
    大須観音,
    上前津,
    鶴舞,
    荒畑,
    御器所,
    川名,
    いりなか,
    八事,
    塩釜口,
    植田,
    原,
    平針,
    赤池
]

const 名港線 = [
    金山,
    日比野,
    六番町,
    東海通,
    港区役所,
    築地口,
    名古屋港,
]

const 上飯田線 = [
    上飯田,
    平安通
]

createLine(東山線, '東山線')
createLine(名城線, '名城線')
createLine(桜通線, '桜通線')
createLine(鶴舞線, '鶴舞線')
createLine(名港線, '名港線')
createLine(上飯田線, '上飯田線')

const 名城線_左 = [
    ナゴヤドーム前矢田,
    大曽根,
    平安通,
    志賀本通,
    黒川,
    名城公園,
    市役所,
    久屋大通,
    栄,
    矢場町,
    上前津,
    東別院,
    金山,
    西高蔵,
    神宮西,
    伝馬町,
    堀田,
    妙音通,
    新瑞橋,
    瑞穂運動場東,
    総合リハビリセンター,
    八事,
    八事日赤,
    名古屋大学,
    本山,
    自由ヶ丘,
    茶屋ヶ坂,
    砂田橋,
    ナゴヤドーム前矢田,
]

const 名城線_右 = [
    名古屋港,
    築地口,
    港区役所,
    東海通,
    六番町,
    日比野,
    金山,
    東別院,
    上前津,
    矢場町,
    栄,
    久屋大通,
    市役所,
    名城公園,
    黒川,
    志賀本通,
    平安通,
    大曽根,
    ナゴヤドーム前矢田,
    砂田橋,
    茶屋ヶ坂,
    自由ヶ丘,
    本山,
    名古屋大学,
    八事日赤,
    八事,
    総合リハビリセンター,
    瑞穂運動場東,
    新瑞橋,
    妙音通,
    堀田,
    伝馬町,
    神宮西,
    西高蔵,
    金山
]

const 名港線_昇 = [
    新瑞橋,
    瑞穂運動場東,
    総合リハビリセンター,
    八事,
    八事日赤,
    名古屋大学,
    本山,
    自由ヶ丘,
    茶屋ヶ坂,
    砂田橋,
    ナゴヤドーム前矢田,
    大曽根,
    平安通,
    志賀本通,
    黒川,
    名城公園,
    市役所,
    久屋大通,
    栄,
    矢場町,
    上前津,
    東別院,
    金山,
    日比野,
    六番町,
    東海通,
    港区役所,
    築地口,
    名古屋港
]